<template>
  <div>
    <header class="header">
      <h1>PRODUCTS<span>商品紹介</span></h1>
    </header>
    <main class="main">
      <section class="miyazaki-gyu section">
        <h2 class="section__title">
          <span class="title__outer"
            ><span class="title__inner"
              ><svg
                xmlns="http://www.w3.org/2000/svg"
                xml:space="preserve"
                viewBox="0 0 560.1 227.6"
                role="img"
              >
                <g>
                  <title>宮崎牛</title>
                  <path
                    fill="#0c0c0c"
                    d="M140.6 133.3c-5.2-.2-11.8-3.7-15.4 2.8-.8-1.2-.1-2.4-.7-3.6l-4.2.2-1.5 3.2c-3 7.1-10.7 6.4-17.6 6.3.5-4.1 2.7-9 1.7-13.1-3.4.4-6.2 3.7-10 1.5 3.9-9.4 21-3.4 21-16.3.7-1 1.6-1.3 2.9-1.8 5.4-9.2 18.1-14.9 16.7-26.9-3.3-10.4-15.8-8.8-23.9-12.1-9.4.3-19.7-4.4-28.3.1-6.7 3.3-16.2 5.5-18.2 13.5 2.8 5.6 1.9 11.4 2 17.7.9 7.6 3.9 15.2 1.6 22.8l5.2 8.3c2.5 4.2 8.3 6.5 6.8 11.6l10.5-2c-.7 1.2-3.3 1.9-5.3 2.5-4.2 0-6.6 5.7-10.4 3.2 0-.7.7-.8 1.4-1.1.4-1.2 2.9-1.1 1.6-2.7-2.2.6-4.4 1-6.3 1.8-3.9.7-6.3 5.9-10.7 3.2-6.7-.6-11.1 4.5-15.3 8.3-3.3 6 4.3 9.9 4.6 15.8l17.8 18c5.6 3.5 11.5 6.6 16.6 10.8 10.7 2.5 20-4.2 30.5-5.1l.1-1.9a2.9 2.9 0 0 1 3.6-2.1c.2-.9.6-1.9 1.1-2.9 1.9-.8 3.1 1.8 4.1 2.2 2-7.8 12.9-11.8 13.1-20-.1-10.6 3.7-20.9 5.6-31.3 0-3.4 3.4-8.5-.7-10.9zm-31.7 13.6-14.3-.7-.1-1c4.6-.7 10.3-1 14.4 1.7zM89.1 92.2c5.1 3.3 12.6.8 18.2 2.4v.7c-4.9 4.8-11.2 6.6-16.7 9.8-2.1-3-2.5-8.7-1.5-12.9zm-2.2-.1c.2 4.1 1.2 8.6.9 11.7-2.4-3-1.4-8-.9-11.7zM87 144l-4.6.8c-.3-.2-.3-1.2-.1-1.5 1.9-1.3 3.4-.4 5.3-1.3l-.8-5.7c1.5.4 3.1 2 3.4 3.4.9 2.4-1.5 4-3.2 4.3zm19.8 29.9c-.4 1.2-.9 2.4-2 3-7.8 2.6-19.9 5.7-26.7-.7-.1-2.4-.7-4.3-1.8-6.4 1.2-.1 2.6-1.8 2.8-3-.4-2.7 4.3-2 4.4-4.4 3.8-6 10.9-7.6 17.6-6.7 3.2-.7 5.5-2.7 8.1-4.6 1.6 7.5-1.2 15.3-2.4 22.8zm67.5-109.3c-5.8-2.8-9.4-9.1-15.7-11.6l-3.7-7.7c-1.8 2.5-4-1.2-6.2-1.3-1.4.6-1.8 2.3-1.8 3.2 1.5.6 3.3 1 4.1 2.6-.4 1-1.4.6-1.9.6-5.3-3.1-13.9-2.1-15.8-9-.5-.2-.7 1.2-.9 2-4.9 1.5-10.2-1.1-13.6-4.1l-.9 1.3c-3.3 1.9-8.3.9-11.6-1.3-3.1-1.5-.4-3.4-.1-5.3-2.7-4.6 0-8.4-1.5-13.6-1.2-4.3 3.2-7.9.1-11.5-7.8-7-17.8-6-28.2-6.1-6.1 5.4-15 4.7-20.8 10.5-1.9 1.3-4.5-.5-5.6 2 2.2 4.2 6.6 8.1 11.4 9 2.8 1.3 4.4 4.3 6.7 5.4l.1-2.2c5.6 3.3 4.6 10.8 6.9 16.2-6.8 2.5-12.9 2.9-19.7 4.5-.3-4.6 5.8-1.8 7.9-4-.6-2.1 1.5-3.9 1.9-5.9-3-.5-7.4-.3-10.6.6l-.1 2.4c-2.8 3-2.8 7.1-4.6 10.4-1.7 1.1-1.8-1.4-2.8-2-5-1.9-9.9-4.7-15.1-5.6-10.4-.1-18.5 8.2-22.4 17.1A39 39 0 0 0 .5 93.8c-.5 3.9 1.4 7.8 1.7 11.9 2.8-1.8 3.4 2.7 6 1.8 2.4-1.6 1.9-4.9 2.8-7.4l1 .7c.3 4.8 3.2 8.9 1.8 14.1.1 1.9 4.2 3.4 4.1 6.5 1.7.4 1.7 4.2 4.3 2.4l-1.1-1.4c2.2-.8 4 1.4 5.3 2.6l-.5.5c.7.2 1.3.9 2 .8 5.3-2.7 13.7-1.5 16.3-7.9 4.7-4.1 10-9.5 10.7-15.7-1.5-.4-1.4 1.3-2.6 1.3-.8-1.1-.4-2.8-.2-4.1 1.4-1.3 2.7.8 4 1.2 1.4-5.1-1.8-9-2.1-14.1 1-4.4.9-9.7 4.7-13 8.4-3.1 15.7-9.8 26.1-9.2l-.4-1.7 4.9-.5c5.5.9 11.5-2.3 15.8.5-1-.9.4-1.2.9-1.7 1.5.2 3.4.1 4.2.7l-2.4 1.3 4.2.7c9.5 6 22.6 3.5 30.6 12.9 3.6 6.1-1.3 12.3-1.4 18.8l-.9 2c-2.5-.1-4.3-2.6-6.6-2.5-1.4 6.1 4.7 8.9 8.2 13 1.1 2.6 1.8 5.4 4.4 7.2.1 1.2-1.3 3.2.2 3.8 2-.3 5.5.7 5.1-2.2 1.9-.3 3.1 2 4.8 2.1l10.6-13.1c1.2-4.9.8-10.9 3.3-15.3.6-2.7-2.3-5.4 1.6-6.3-1.6-6.6 2-12.4 3.4-18.2l-1-1.7zM9.7 95l2.1 2.1c-1.2.5-2.1-.9-2.1-2.1zm15.8 26.3c1.2-.1 3 .1 3.5 1.2-1.2.8-2.7-.3-3.5-1.2zm18-62.3c-.4-2.6.3-7.2 3.8-6-1.3 2-1.9 4.9-3.8 6zm12.3 12.5c1.7-1.1 3.8-2.1 5.8-2.7-.1 2.1-3.6 1.9-5.8 2.7zm35.4-61.3c-1-.2-2.8-1.3-3.1-2.5 1 .7 4.2.5 3.1 2.5zm264.3 95.4c-1.3-2.8 1.8-4.8 2.8-6.8-10.3-9.2-22.6-13.2-33.9-19.7-.8-2.8 3.8-1.8 5.4-3.6 8-4.9 18-6.2 25.1-12.7-.5-5.5 1.9-11.6-.6-16.2-10.7-2.9-21.4 2.4-30.9 6.9l-1.6-1.3c1.3-7.4 6-14.6 3.1-22.3-1.7-2.3-3.9-4-6.7-2.3-1.3-1.1-3.7-5.2-5.6-1.4-5.6-1.6-11.8-3.5-17.4-4.9-.1 4.6 2.6 8.5 3.5 13.2 2.1 8.8-2.1 17.2-1.5 26.1-6.2 10.5-19.3 11.2-28.6 17.7-2.4.4-1.1 4.4-1.3 6.9 1.9 1.3 4.6 1.5 4.1 4.2-1.8-.6-3.6-.7-5.3-.7-4 12.2-9.6 24.7-16.9 36.2-2.2.2-4.4.1-6.1-1.2-.2-2.1-.2-4.5.9-6.4 2.5-7 .6-16.5 6.4-21.6l-.3 4.6h.5c3-12.7 15-22.7 20.5-34.8 1.3-1.8 3.8-1.8 4.9-3.9l-.4-.9c-1-.4-1.6 1.4-2.6 1.2-3-.5-4.5-3.5-6.7-5.2-7.1-6.6-11.3 3.9-17.1 5.7a72.3 72.3 0 0 0-31 57.6l-.9.8a34.8 34.8 0 0 1-4.1-14.2c-2.3-8.3 4.4-16.2-.1-24-2.9.8-5.8 2-8.1 3.9-6.6 6.4-13.8 14.1-11.1 24-.3 9.7-1.2 20.7 1.2 29.9 3.8 3.8 5.3 8.9 8.2 13.3 3.6 3.3 7.4 7.3 12.4 7.6 14.2-5.2 26.8-5.6 41.8-9.4l3.2-3c4.2-.1 4.1-6.4 8.4-5.9.3-1.9-4-3-1.7-4.9 15.1-1.1 26.7-9.7 41.6-9.1 4.1 3.7 6.3 8.4 8.5 13 2.4 2.4 2.2 5.4 1.8 8.3a71.4 71.4 0 0 1-3.1 44.6c-2.5 2.4-4.3 10.1-9 4.9l-.6 1.5-11.2.1-.7.5 2.7 2.2c1.8 6.1 8 10.6 11.5 15.9 5.2 2.2 10.4 5.1 16.3 6.5 7.3-2.1 11.7-10.5 13.3-17.2a19 19 0 0 1-4.6 7c-2.3-1.3-2.4 3.1-4.4 2.8 1.9-6.2 6-11.9 9.5-17.8 1.4 1.3.1 3.4.7 5.3h.5c5.4-16.5 6.3-34.8 5.4-52.8-.6-8.7-4.1-17.1-2.8-25.9 3.5-2.7 8.2-5.1 12.7-4.5 1.8.6 3.7 1.8 4.8 3.4 1-.3 2.2-.4 2.6-1.7 2.6-4.4 1.4-11-1.2-15.1l-6.2-4.4zm-16.3-50.8c1.6-1.3 3.8-2 5.7-2.9.1 1.2 1.2 1.8 1 3.1l-6.8 2.1c-1-.5-.3-1.5.1-2.3zm-7.5 7.5 5.7.2c-1.1 1.8-4.1 1.6-6.3 1.8-.5-.2-.6-1.7.6-2zM199 134.5a24.8 24.8 0 0 1-2.1-16.8c2.9 4.9 2.1 11.2 2.1 16.8zm26.5-13.3c-1-3-1.1-6.7.8-9.8 2.1 2.7.2 6.6-.8 9.8zm43.1 8.6-1.5.1c.9-1.5.3-4.9 2.5-4.8 0 1.5-1.6 2.8-1 4.7zm1.9-24.9c-.2.5-.4 1-1.2.9l.4-5.9c1.4 1.1 1.6 3.5.8 5zm3.2-2.7c-1.5-.1-.2-1.7-.7-2.6 1 .4.6 1.7.7 2.6zm1 15.4c-.4.8-1.1 1.5-2.1 1.6-1-2.6.8-4.7 1.6-6.7.1-4.1 1-8.1 2.3-11.9 1.6 3.3 3.7 7.7 8.1 9l7.6 1.7c-5.5 2.6-10.9 5.5-17.5 6.3zm22.5 1.6-.6-.7c0-2.4 4.3.8 2.5-2.4 1.4-.6 3.8-1.3 4.7-.2-1 2.3-4.2 2.6-6.6 3.3zm27.5 55.7c-.7-2.1-.2-4.6.4-6.8.9 2.3.4 4.7-.4 6.8zm1.3-9.6c-1.2-2.3-.8-5.8-.8-8.7 1.4 2.6 1.3 6 .8 8.7zm1.6 47.6c.1-3.9 3.1-6.8 4.2-10.6.8 3.6-1.8 7.7-4.2 10.6zm-33.5-102.1c8.5-5.2 9.2-15.4 17.4-20.7l5.2.2c6.5 5.2 13 10.7 19.9 13.7-13.5.5-28.8 4.1-42.5 6.8zm43.3.4c3.5.1 7 .6 9.5 2.8-3.5 0-7-.4-9.5-2.8zm-24.9 68.9c3.6-6.7 2.9-14.3.7-21.7l-4.9-6.8-1.9 1.1c-5.7-4.3-10.9-9.7-18.3-8.7-3.2 2.7-8.2.2-11.4 2.5-4 5-9.2 7.9-14 11.7-3 2.7-5 7.7-8.8 9.3-3.5.1-4.7 2.9-8 2.7a7.3 7.3 0 0 0-3.6 6.6c.8 6.3.6 11.1 3.4 16.7 1.1-1.1.9 1.6 2.6.9 0 2.7 2.8.7 2.3 3.4 1.9-.6 3 2.6 5.1 3.7.5 0 1.1-1.3 1.7-.2 1.2.1.7 1.9 1 2.6 5 2.7 4.4 9.3 4.3 13.2 1.9-.6 1.4-3.3 2.2-5 0-2.2 1.9-.7 2.9-.5l-1.1 1.3c5.6 1.7 9.5-4.3 15.6-2.6 3.9-1.3 1-8.1 6.7-7.4 7.5-8.7 18.5-12.2 23.5-22.8zm-21.7-10.9c-3.2 4.9-8.1 9.2-12.4 13.5a19.1 19.1 0 0 1-6.2-7.4c4.5-4.8 10.6-8.2 16-12.4 1.7 1.6 3.4 3.6 2.6 6.3zM533.4 142l3.6 2.9a24 24 0 0 0 19.8-1.7c-.6-.4-2.4-.8-2.1-1.9.4-7.1 4.3-15.1-3.2-20.3 1.1-2.5-3.4-3.8-1.7-6.1-1.5.2-2.8.4-3.8 1.5a28 28 0 0 0-8.8-5.2c-3.6-.4-7.5-1-10.9-.8-.4.4 0 1.1.4 1.3.4.4.9-.4 1.5-.4.4.2.8.7.6 1.1-1.3.8-2.8 2.1-3.9 3.1-1.9.8-3.9-3.4-4.7 0l-1.5-1.3c-8.8-1.1-18.7 3.5-27.5 1.9l1.5-1-.9-1.3a61.5 61.5 0 0 1 1.9-26.8c.4-1.4 3.2-.6 1.9-2.7 1.7-.2 1.5 2.1 2.2 2.5l1.5-2.5c5.8.4 11.2-.8 16.7-1 1.5.6.4 3.1 1.7 3.5 8.4-1 15.9-6.9 21.5-13.6.4-1.9-1.7-4.6 1.3-5.6 3.9-4.4-.9-8.6.4-13.2a21.5 21.5 0 0 0-11.4-3.1c-5.1.2-10.1.7-14.6 2.5l-24.7.6c-1.5-6.7-.2-13.8-1.3-20.7 1.5 0 .4 1.9 1.7 2.1-1.3-4 3.9-7.3 0-10.5a7.6 7.6 0 0 0 1.7-5.6c-3.4-5.9-3.4-14-10.3-17.4l-.4 1.1-2.6-1.1-.9-1.9c-3-1-6 .6-9.2.6a164 164 0 0 0-23.4 16.3c.4 4.2 5.8 3.1 8.4 5.6.2.6.9 2.1 0 2.7-.6-.6-.6-1.5-.9-2.5l-3 3.8-3.2-1c-3.2 2.1 3.8 3.5.4 5.7 1.3 1.5 3.2 2.3 4.7 3.5l-.9 4.8c1.1.6 2.4.6 3.7.6 3.6 5 1.9 12.3 2.4 18.2-3 1.1-6-.8-8.6.2a22.7 22.7 0 0 0-12.6-19c-4.1 0-7.3-2.5-11-3.8-10.1-.6-19.3-4-30-3.3-1.9 1-1.7 3.8-2.4 5.7-1.1 2.1.9 3.5 2.8 3.3 3 1.7 2.6 5.2 3.4 8.2 2.1 6.7 10.5 5.2 14.8 10.5.9 2.3-2.8 1.5-3.4 3.5 1.9 8 2.8 16.3 3.7 24.5-1.7 7.1-1.7 14-5.1 20.5l-.7 11.3h.4c.4-.4-.2-1.9 1.1-1.5 2.4.2 1.7 2.5.8 3.8 1.1-.2 2.6-2.5 4.5-2.1 1.1.2 2.6 1.5 2.4 2.5-1.3.2-2.8-.2-3.9.8 1.3 1.1 2.4 2.3 3.9 2.7 2.8 1.2 5.6-.8 7.7-2.7A80 80 0 0 0 443.4 88c5.6 3.5 9.9-3.6 15.2-1.7 2.1 10.9.9 22.8 1.7 34.1l-.6 1.7c-3.7 1.3-7.5 2.7-11.6 3.1-6.2.2-11.6 6.7-17.6 2.5-1.1-1.5-1.5 1.3-2.8.4l-.2-1.9c-2.1-.2-1.1 2.5-2.6 3.6-.9-.4-.2-1.5-.4-2.1-2.1-.8-2.4 1.7-2.8 3l-2.8-1.1c-.6 1.5-1.7.2-2.8.4-2.4 3.2-7.7 3.2-8.4 7.5-5.4 6.1-5.8 13.4-7.9 20.7a4 4 0 0 0-2.4 1.9c3.9 4.2 6.2 8.8 8.8 13.2 2.2.4 2.8-1.9 4.9-.6 2.6 1.3 2.1 4.6 1.9 7.1 3.6-2.3 6.6-6.5 10.5-8.4l-.2.4 6.6-5.2c2.8-2.1 6.9-1.5 9.5-4.6 5.3-3.6 11.1-8.6 18.2-6.5V154l2.4 1.9c.2 13.6-.9 26.4-1.3 40-.4 4.4-1.1 9-3.2 12.3-1.5-.6-3.6-.8-3.6-2.9l-1.1.4c-2.6 7.1 1.1 14 3.4 20.3 5.8 1.9 10.3-3.5 16.3-3.3 3.2 0 5.8 2.1 7.7 4.6 2.5 1 4.7-1.7 6.4-3.6l1.3-5.6c.9-7.1 1.5-15.1.9-21.8.6-1.5.4-4.2 2.1-5 .4-1.7.2-3.4-.4-4.8 1.5-2.1 1.7-5 1.9-7.5l-1.5-.4c.4-3.4 2.4-6.3 2.1-9.4 1.3-6.3.4-12.8 3.2-18.2 1.1.8.9 2.1 1.5 2.9.4-2.9-2.8-5.8-.2-8.8 12.2-2.7 25.5-4 37.9-3.1zm-3.2-29.7c1.5.6 4.3.8 4.7 2.1l-4.7-.4v-1.7zm-119.1 4.8c-.2-.8.9-.2 1.1-.6l-.2-2.1a4 4 0 0 1 1.5 2.1c-1.1-.3-1.5.8-2.4.6zm11.7-20.9-.4.2-.2-5.4c1 1.2 1.2 3.5.6 5.2zm16.5-47.1c-.2-1 .2-.4.9-1 .5 0 .5.4.5.8l-1.4.2zm25.5 104.2-.9-1.2h1.3c.7.3-.4.7-.4 1.2zm20.2 15.4c1.3 4.2 0 9.4-1.9 13.4-.5-4.8 1-9 1.9-13.4zm-3.9 31 1.5-1.9-1.5 4.2c-4.5-4.6 1.3-10 .4-15.5l2.4-3.4c1.3 6-3 11-2.8 16.6zm3.9 7.5c-.9-2.5.6-5.2.8-7.7.7 2.5 0 5.4-.8 7.7zm2.5-95.6c.9.4.9 2.3.9 3.2-.9-.5-.9-1.9-.9-3.2zm28.4-36v.4c-1.1.2-1.1-.4-1.3-1.1.6-.1.8.6 1.3.7zm-19.1-20.2c1.3.2 2.4-.4 3.6-.4-.4 1.2-2.1.8-3.6.8v-.4zm-5.8 2.9c4.5-.4 9.9-1.7 14-.4v.4c-4.1 1.3-9.2.4-14 .7v-.7zm.4 62.5v-1.1c5.6-.2 10.9-1.6 16.7-1-4.9 1.7-10.9 1.7-16.7 2.1z"
                  />
                </g></svg></span
          ></span>
        </h2>
        <div class="miyazaki-gyu__text">
          <p class="text-main">
            「宮崎牛」は、宮崎県で生産された黒毛和種の牛肉のうち、
            肉質等級が4等級以上のものに与えられる名称です。その特徴は、極上な肉質ときめ細やかなサシ。口に含むとほのかな甘みと芳醇な香りが広がります。当店では特にA5ランクの中でも最上位のものを主に使用。最高の和牛の味をお楽しみ下さい。
          </p>
          <div class="text-sub">
            <h3>受賞採用歴</h3>
            <ul>
              <li>
                全国和牛能力共進会 3大会連続内閣総理大臣賞受賞
                (第9回・10回・11回)
              </li>
              <li>
                3年連続「米国アカデミー賞」アフターパーティー&nbsp;公式メニュー採用
              </li>
              <li>大相撲年6場所において優勝力士へ進呈</li>
              <li>Jリーグ アウォーズ最優秀育成クラブ賞として進呈</li>
              <li>ダンロップフェニックストーナメント歴代優勝者に進呈</li>
            </ul>
          </div>
        </div>
        <div class="section__image">
          <div>
            <picture>
              <source type="image/webp" srcset="~assets/image/products/photo-01.webp" />
              <img src="/products/photo-01.jpg" alt="宮崎牛イメージ01" />
            </picture>
          </div>
          <div>
            <picture>
              <source type="image/webp" srcset="~assets/image/products/photo-02.webp" />
              <img src="/products/photo-02.jpg" alt="宮崎牛イメージ02" />
            </picture>
          </div>
        </div>
        <section class="price-section">
          <h3 class="price-title">参考価格</h3>
          <dl class="product-list">
            <div class="product">
              <dt>バラスライス</dt>
              <dd><span>100g</span>&yen;358<span>(税込&yen;387)</span></dd>
            </div>
            <div class="product">
              <dt>モモバラ切り落とし</dt>
              <dd><span>100g</span>&yen;410<span>(税込&yen;443)</span></dd>
            </div>
            <div class="product">
              <dt>モモ焼肉</dt>
              <dd><span>100g</span>&yen;580<span>(税込&yen;627)</span></dd>
            </div>
            <div class="product">
              <dt>肩ローススライス</dt>
              <dd><span>100g</span>&yen;660<span>(税込&yen;713)</span></dd>
            </div>
            <div class="product">
              <dt>特上カルビ焼肉(バラ)</dt>
              <dd><span>100g</span>&yen;760<span>(税込&yen;821)</span></dd>
            </div>
            <div class="product">
              <dt>ローススライス</dt>
              <dd><span>100g</span>&yen;780<span>(税込&yen;843)</span></dd>
            </div>
          </dl>
          <div class="urikata">
            <p>
              業務用・箱売り・ブロック等での販売も対応いたします。<br />お気軽にお問い合わせください。
            </p>
          </div>
          <div class="price-tyui">
            <ul>
              <li>上記は参考価格です。時期により変動する場合がございます。</li>
              <li>カットの方法や部位により、価格が異なります。</li>
            </ul>
          </div>
        </section>
      </section>
      <section class="ohsyanton section" id="ohsyan">
        <h2 class="section__title">
          <span class="title__outer"
            ><span class="title__inner"
              ><svg xmlns="http://www.w3.org/2000/svg" xml:space="preserve" version="1.1" viewBox="0 0 560 227"><g><title>上州豚とことん</title><g class="tokoton"><path d="M199 87c7-2 13 5 19 9 9 3 15 18 4 24 0 5-5 1-7 4-4 2-8 2-12 1-10 5-22 1-30-4-4-2-6-7-9-5l-6-6c0-2-3-1-2-3l1-4c0-3 4-1 4-4 3-4 5-8 9-11 5 1 3-4 9-1 5-2 14-2 20 0zM174 154c1 3 5-1 6 3 3-1 6 0 9 1 8 3 16 1 24-2 3 0 4 5 6 7 5 6 9 12 5 20-14 17-41 10-56-1-14-13-24-30 6-28zM267 39c8 2 9 9 14 15 2 5 0 11 3 15 2 1 0 3 2 4-3 4 3 5 1 8l4 16c5 2 5-6 9-6 3-1 6-5 9-5 0-3 3-2 4-3 2 0 3-2 4-1 2 0 2-2 4-1l2-1c1-1 2-4 4-3l13-3c6 3 11 4 16 9 0 2 1 2 2 3l1 4 1 1c0 2-1 12 1 13 0 3-4 1-3 4 3 3-4 4-1 7l-1 3c-1 0-2-1-2 1-1 2-6-1-3 3-3 0-5 4-6 3-2 0-2 4-4 2-1 1-3 1-3 3h-1c-1 4-7 4-9 9l-2-1c0 3-3 1-3 4-2 0-1 3-4 3-4 1-4 8-8 7-2 2-6 9-4 10l-2 4c2 1 4 2 3 5 1 1 4 0 3 2 1 2 3 0 3 3 3 0 2 3 4 3 7 6 8-1 11 3 3-1 7 4 10 0 2-2 4 2 6 0 6-1 4-4 8-6-4 5 2 4 1 1 4 0-1 7 4 5-1-1 3-2 1-4 1-3 0 3 1 4 2-3 1-3 2 1 1 0 2 0 3 2-2 1 3 1 1 3 3 1 1 5-1 9 1 1-6 7-7 7l-10 13c-11 5-39 5-46-3-3 0-3-3-5-3s-1-2-3-3c-6-1-7-6-10-6 0-2-2-2-4-4 0-2-3-3-3-5-2 0-2-2-2-3-4-2-5-6-7-9 0-2-3-4-2-6 1-4-6-6-6-12l1-18c3-4 0-8 3-11 2-2 3-4 1-6l-3-1c3-4-3-3-1-6l-5-11c1-5-4-6-1-11-2-3-3-4-2-7-2-1-1-3-1-5 2 0-1-2 0-3 2-3-3-5 1-6l-1-6c-3-7 2-6 2-10 0-6 2-11 4-15 3-1 0-7 5-6 0-1 2-3 4-2zM359 168l1-2-1 2zM362 167h-1 1zM359 169v1-1z"/><path d="M362 170c-1 0 0 3-1 1-1-1 1-1 1-1zM352 173l1-3-1 3zM358 172c-1 0 0-2 0 0zM361 173h-2c1-1 1-2 2 0zM357 172c0 2-2 4 0 5-3 0-1-3 0-5zM352 173l-1 1 1-1zM361 177v1c-2 0-2-3-1-4 1 0-1 2 1 3zM350 175c0 1 0-1 0 0zM346 176l-1-1 1 1zM358 176zM348 179v-2 2zM357 179h-1 1zM344 178c0 2-2 1-2 0h2z"/><path d="M70 14c7 4 16 16 12 25 2 7-3 13-5 20l-2 6c-1-1-2 1-2 2 0 5-5 6-3 12 4 3 12-4 17 0 9-4 21-1 30 2 1-1 2 0 2 1 0 2 3 2 3 4 3-2 3 4 5 4 2 7 2 12 1 19-1 2 1 5-2 7-4 1 1 5-3 6 1 4-8 8-11 9-2 1-3 4-5 2-3 2-5 2-9 1-7 1-12-1-18-2-5-2-9 3-14 1 0 3-8 0-7 3-9 3-21 15-10 22 0 2 2 1 3 2 3 1 4 4 8 2 1 0 3 3 5 2 4 1 12 0 13 4l8 3c2-2 4 1 6-1 3 7 21-1 26 1v-1c3 0 5-2 6 0v-1l12-2c-2 2-7 0-9 2h6c-15 3-7 4 2 3 1 1 4 1 2-1h2-1l2 1v1c-2-2-2 2-4 1l-1 1c-1-2-2 3 2 0h-1c3-2 1 1 3 2 1-1-1-4 1-3v2l1-2c-1-2 1-1 2 0 2-2 4 4 0 2l-1-2v3c-1 0-2-1-1 1l-2 1 1 1c0-2 2 0 2-2 1 1 0 3-1 4 1 1 2-2 3 0 2 0 2-1 2-3v-1l-1 1h-2c4-5 6 4 0 4l-5 7v2c-1 2-2 8-7 8 1 3-3 0-1 3-2 0-1 1-2 2l-1-1c0 3-3 0-2 3-2 0-8 3-8 5-18 12-43 9-61 0-2 2-3-2-5-1-1-4-5-1-6-4-5-1-7-6-11-7a86 86 0 0 1-25-36c-4-21 2-39 16-54 21-15 9-9 7-22-3-6 1-13 0-18 0-1-1-3 1-4 0-5 2-12 4-15 1-5 3-4 1-11 4 0 5-4 6-8 2-1 4-3 4-5 3-2 2-6 5-6 1-5 6-2 7-6 2-2 8-6 10-1zM140 168l-1-1 1 1zM138 168h-3 3zM135 168l-1 1 1-1zM139 169h-1 1zM137 170h-1 1zM142 170zM136 170l-3 1 3-1zM133 171h-2 2zM143 172h-2 2zM145 179v1-1zM144 181h-1 1zM132 202h-1 1z"/><path d="M436 44c1 1 2 2 3 1 1 0 3 3 5 1l3 4c3-1 2 3 4 2v2c3 0 3 4 2 6 5-1 1 5 4 5l1 4c0 2 0 10-2 11 1 2-2 2-2 4 1 3-1 5 1 7-4 4 1 5-6 5 1 4-5 8-2 11-5 3-3 11-9 13 2 3-3 3-3 6s-2 5-4 6l-1 2c0 2 1 3-1 4 2 1 0 3 0 4-2-1-1 2-3 2 1 1 0 4 2 4-3-1-2 3-2 4 1 0 5 0 4-2 2-1 3-3 6-3 3-3 7-13 11-6 0 2-3 2-1 4 0-2 4-1 2-3 1-2 3-3 2 0 2 0 3-2 1-3 2 0 3-2 3-4 2 0 8-4 8 0-2 2-7 2-6 5 9-5-1 2 6 0 1-2 3-3 2-5 2 0 9 0 4-2h2l-1-1c-2 1-3-1-4-1-1-1 5-2 6-2 6 2 11 2 15 9 3-1 0 3 3 3-2-5 4 2 3 4 4 3 1 8 5 10-1 3 1 4 1 6 1 1-1 4 2 5 1 6 2 10 8 12 2-4 9 2 11-3 2 3 4-1 4-2 2 1 2-4 5-1l-1-2 7-7c4-2 2-6-1-2 1-1-1 0-1-1 5 1 1-6 5-3 0-2 0-3 1-1h2c0 2-4 1-2 3 2 0 2-4 4-3v-2c4 2-2 4-2 6-1 1-3 3 0 3 1-3 3-3 5-4 2-5 2 1 4 2-2 0-1 2-2 3s-3 2-1 2c3-3-1 4-2 3 1-3 0-2-1 0 1 1-2 3 0 4 1-2 2-5 3-2-1-2-5 6-3 7v2c-3-1-4 5-5 7 1 2-3 5-2 6-2 2-3 0-3 4-1-1-1-1-1 1-1 0-2 1-1 2-3 0-1 4-1 5-2 1-2 5-4 5l-1 2v-2c-1 1-1 2-3 1-1 3 0 1 2 2l-5 2c0 2-2 1-3 2v-2c0 2-3 0-3 2-2 0-4 4-7 3-1-1-5 2-4-2-2 1-4 2-5 0-1 3-6-2-8-3-5-1-2-5-4-6-1 3-1-1-3-1-1 1 2 4-1 3 0-2-3-4 0-3l1-2-2-4c-2 1 2 4-1 4v-1l-8-15c-1 1-3 0-1-1-2-1 0-3-1-4-3-3-1-7-4-7 2-4 0 0 2-2-1-2-2 0-3-1l1-1c-1-1 2-2 0-3 0 2-1 0-2 0l1-1 3-3c0-2-3-3-3 0v-1 2c-2 0-1-1-2-2-5 4-9 10-13 16-6 5-5 16-12 20-1 5-5 9-10 10-11 4-23 2-32-5-2-1-2-4-4-3-2-4-8-5-8-10-2-1-4-1-3-3 0-1-3-1-2-2 0-3-5-1-2-4-2-1 0-4-2-5-1-2 2-3-1-5l-3-10c4-2-3-6 0-14 2 0 0-3 1-5s2-5 1-8c1 1 2-1 1-1l3-21c0-4 4-7 3-12 4-1 3-8 5-11 4-1 0-4 2-5 1-3 4-4 5-8 2 1 2-3 2-4 0-4 6-1 5-6l3-4c1-3 7-5 7-9 3 0 5-6 8-5 2-1 4-2 4-4 1 1 4 0 3-2l2 1c1-3 3 1 4-2l7-1zM463 130l-3 1 3-1z"/><path d="M459 131c-2 1-13 9-8 4-1-2 2-1 4-2 1-1 3-3 4-2zM464 132h-1 1zM448 136v2-2zM447 137l-1 1c-1-1 0-2 1-1zM455 141l-1 1c-1-1 1-2 1-1zM451 143h-1 1zM547 146c2-2-3 10-4 8 1-2 7-9 2-7 1 0 2-1 1-2l1 1zM428 147v-1 1zM544 148h-1 1zM552 150v-1 1zM548 151c-1 0-1-1 0 0zM541 153c-2 1 0-1-1-2l1 2zM543 151c-1 0 0 0 0 0zM550 152v-1 1zM552 152h-1 1zM426 153l-1 1 1-1zM540 154c0 1-2 0-1 1-2 2 1-5 1-1zM549 154c1 1-2 0 0 2-3 1-2-3 0-3v1zM552 154l-1 1s0-2 1-1zM547 154h-1 1zM527 155l-1 1 1-1zM546 156l-1-1 1 1zM551 158v-1 1zM547 158l1-1-1 1zM534 159h-1 1zM550 160s-2-1-1-2l1 2zM546 160c-1 1-1 0-1-1l1 1zM548 160s0-1 0 0zM549 164h-1c1-2 1-3 1 0zM532 162c0 1 0 0 0 0zM551 163v-1 1zM551 163l-1 1 1-1zM548 165c-1 0 0-1 0 0zM550 165v-1 1zM536 165h-1 1zM541 165c0 2-2 1-1-1l1 1zM466 166c0 1 0 2-1 1l1-1zM527 167h-1 1zM548 167s-1 0 0 0zM533 168v1-1zM519 168h-1 1zM468 171l-2-1c0-3 2-1 2 1zM523 169h-2 2zM525 170h-1c1-1 2-2 1 0zM518 169l-2 2 2-2zM519 170l-1-1 1 1zM514 170l-1 1 1-1zM524 171h-1c1 0 0-2 1 0zM548 171l-1-1 1 1zM471 177c-1 1 0 2 1 2v2c-3 1 3 5 0 7l1-1 1 6c-7-9 0-11-6-11 4-2-2-1 0-3 2 2 2-2 0-2 2 0 1-5 0-3-1-2 1-1-1-2 3-2 1 4 4 5zM522 171l-1 1 1-1zM515 172h-1 1zM520 172h-1 1zM518 172v1-1zM521 172l-1 1 1-1zM515 174l-1-1 1 1zM463 176l-1-1c0-3 1 0 1 1zM513 174c-1 0-1 2-3 2 0-1 2-3 3-2zM517 173c-1 1-2 1 0 2 1 1-2 1 0 0-2 0-1-2 0-2zM518 174l1-1-1 1zM515 177v-2 2zM544 176c-1 1-1 0-1-1l1 1zM461 178l-1-1 1 1zM546 178c-1 1-1-1-1-1l1 1zM509 178c4 2-5 2-5 0 2 0 5 2 5 0zM465 180l-1-2 1 2zM466 179h-1 1zM545 179l-1 1 1-1zM466 181h-1 1zM544 181l-1 1 1-1zM467 183l-1 1 1-1zM463 184l-1-1 1 1zM464 185h-1 1zM472 185h-1 1zM464 186c0 1 0 0 0 0s0-1 0 0zM461 186h-1 1zM465 187v2-2zM540 188v1-1zM465 189l-1 1 1-1zM467 190l-1-1 1 1zM540 190s0 2-1 1l1-1zM470 192c-1 1-1-1-1-1l1 1zM539 192c0 2-2 0-1-1l1 1zM466 192h-1 1zM540 193h-1 1zM477 198l2 3c-5-2-6-13-2-3zM537 198c0-6 1 0 2-4 2 1-2 4-2 4zM537 199h-1 1zM536 200c1 1-2 1-1-1l1 1zM533 201c-2 0-1 1-1 2 3-1 3-1 1 1l-1 2c-2 0 0-3 0-4-1-1 2-3 1-1zM536 201l-1 1 1-1zM531 203v1-1zM526 205l-1-1 1 1z"/></g><g><path d="M122 49h19v5h-40v-5h16V16h6l-1 13 16-1v6l-16-1v16zM152 27l-3 13-4-2 3-12 4 1zm6 5c0 11-2 17-9 24l-3-4c10-9 8-24 7-36h6l-1 16zm4-6 4 11-5 2c0-5-1-8-3-11l4-2zm9-9v36h-5V17h5zm3 9 5 10-4 3-4-12 3-1zm10-10v40h-6l1-40h5zM196 42c0 7-1 11-3 14l-4-4c2-2 4-22 3-35h12v11c4-2 6-3 8-6h-6v-5h24v5h-8l2 9 3-5 4 3-6 7 7 11c-2 1-2 2-3 5-8-10-9-16-11-30h-1l-3 4c6 6 8 20 5 28-1 2-5 2-9 1l-1-4c8 2 7-3 7-9-3 4-5 6-10 9l-2-2c1 5-1 7-7 6l-1-4c1 0 4 1 4-1v-8h-4zm0-10v6h4v-6h-4zm4-11h-4v7h4v-7zm4 16 9-6-2-2-5 3-2-2v7zm0 10c5-3 8-6 11-10l-1-3c-2 3-4 5-8 7l-2-2v8z" class="st1"/></g></g></svg></span
          ></span>
        </h2>
        <div class="miyazaki-gyu__text">
          <p class="text-main">
            梅の郷、群馬県は榛名で、本当のおいしさを追求するためおいしい水と梅を飼料に「とことん」こだわりぬいて育てられた高級豚肉の逸品。「とことん」のおいしさの秘密は、群馬県安中・榛名地区の豊かな自然環境の中、生産者が大切に飼育していることと「えさ」にあります。梅の郷ならではの梅エキス（クエン酸）を飼料に取り入れ殺菌効果や消臭効果、健康増進などの飼育効果をあげています。また、肉の美味しさで人気のある2種の豚、黒豚とハイブリッド。優良品種の交配により誕生しました。
          </p>
          <div class="text-sub">
            <h3>おいしさの秘密</h3>
            <ul>
              <li>
                食肉のキメが細かく本来の自然な肉色である鮮紅色をしております。
              </li>
              <li>
                肉に風味があり、豚肉特有の臭い（獣臭）がほとんどありません。
              </li>
              <li>肉に甘味があり、やわらかくソフトです。</li>
              <li>
                鮮度保持能力に優れ、脂肪及び赤身の鮮度が長持ちし、変色がありません。
              </li>
              <li>
                カット肉は徹底した衛生管理の認定工場で処理され、細菌数が極端に少なく日持ちが良く安全で安心です。
              </li>
            </ul>
          </div>
        </div>
        <div class="section__image">
          <div>
            <picture>
              <source type="image/webp" srcset="~assets/image/products/photo-03.webp" />
              <img
                src="/products/photo-03.jpg"
                alt="上州豚とことんイメージ01"
              />
            </picture>
          </div>
          <div>
            <picture>
              <source type="image/webp" srcset="~assets/image/products/photo-04.webp" />
              <img
                src="/products/photo-04.jpg"
                alt="上州豚とことんイメージ02"
              />
            </picture>
          </div>
        </div>
      </section>
      <nuxt-link class="btn-home" to="/">ホームに戻る</nuxt-link>
    </main>
  </div>
</template>

<script>
export default {
  transition: {
    name: "page",
    mode: "out-in",
  },
  head() {
    return {
      title: "商品紹介",
      htmlAttrs: {
      lang: 'ja',
      prefix: 'og: http://ogp.me/ns#',
    },
      meta: [
        {
          hid: "description",
          name: "description",
          content:
            "『あんず お肉の工場直売所 つくば店』で販売する商品のご紹介。日本一に輝いた和牛の【宮崎牛】や群馬の国産ブランド上州豚【とことん】など自慢のお肉を取り揃えております。",
        },
        {
          hid: 'og:description',
          property: 'og:description',
          content: '『あんず お肉の工場直売所 つくば店』の取り扱いブランドのご紹介。日本一に輝いた和牛の【宮崎牛】や群馬の国産ブランド上州豚【とことん】など自慢のお肉を取り揃えております。',
        },
        {
          hid: 'og:image',
          property: 'og:image',
          content:
            'https://meatfactory-tsukuba.com/products/ogp-image.jpg',
        },
      ],
    };
  },
};
</script>

<style lang="scss" scoped>
$color-red: rgb(188, 2, 2);
$max-width: 1360px;

.header {
  height: 20vh;
  position: relative;
  background-image: url(~assets/image/products/bg-top.jpg);
  background-size: cover;
  background-position: center center;
  &::after {
    display: block;
    content: "";
    background-color: #000;
    width: 100%;
    height: 100%;
    opacity: 0.25;
    z-index: 1;
  }
  h1 {
    width: 100%;
    text-align: center;
    position: absolute;
    top: 50%;
    left: 50%;
    transform: translateY(-50%) translateX(-50%);
    z-index: 2;
    font-family: "Archivo Narrow", sans-serif;
    font-display: swap;
    font-weight: 700;
    font-size: 3.8em;
    color: #fff;
    @media screen and (max-width: 500px) {
      font-size: 12vw;
    }
    span {
      display: block;
      font-size: 0.3em;
      letter-spacing: 0.3em;
      &::before {
        content: "-";
      }
      &::after {
        content: "-";
      }
    }
  }
}

.main {
  padding: 0 0 40px 0;
  @media screen and (max-width: 780px) {
    padding: 0 0 5vw 0;
  }
}

.section {
  padding: 40px 0 80px 0;
  @media screen and (max-width: 780px) {
    padding: 5vh 0 10vh 0;
  }
  &__title {
    position: relative;
    margin-bottom: 40px;
    @media screen and (max-width: 1099px) {
      margin-bottom: 3vh;
    }
    &::before {
      display: block;
      content: "";
      border-bottom: 7px solid rgb(236, 231, 225);
      position: absolute;
      bottom: 0;
      z-index: 1;
      @media screen and (min-width: 1100px) {
        left: -60%;
        width: 100%;
      }
      @media screen and (max-width: 1099px) {
        width: 60vw;
        min-width: 300px;
      }
    }
    .title__outer {
      position: relative;
      z-index: 2;
      display: block;
      max-width: $max-width;
      margin: 0 auto;
      padding-left: 20px;
      .title__inner {
        display: block;
        width: 350px;
        @media screen and (max-width: 780px) {
          width: 40vw;
          min-width: 200px;
        }
      }
    }
  }
  &__image {
    display: flex;
    justify-content: center;
    padding: 0 0 40px 0;
    div {
      max-width: 400px;
      margin: 0 15px;
      border-radius: 10px;
      border: 1px solid #999;
      overflow: hidden;
      @media screen and (max-width: 780px) {
        margin: 0 1vw;
        border-radius: 5px;
      }
      img {
        width: 100%;
        max-width: 400px;
      }
    }
  }
}

.miyazaki-gyu {
  &__text {
    max-width: $max-width;
    margin: 0 auto 40px auto;
    display: flex;
    justify-content: center;
    align-items: center;
    @media screen and (max-width: 780px) {
      display: block;
    }
    .text-main {
      width: 50%;
      line-height: 1.7em;
      padding: 2em;
      box-sizing: border-box;
      font-size: 1.15em;
      @media screen and (max-width: 780px) {
        width: 95%;
        margin: 0 auto;
        font-size: 1.05em;
        padding: 1em;
      }
    }
    .text-sub {
      width: 45%;
      background-color: rgb(242, 238, 224);
      padding: 20px;
      box-sizing: border-box;
      @media screen and (max-width: 780px) {
        width: 90%;
        max-width: 500px;
        margin: 0 auto;
        font-size: 0.9em;
      }
      h3 {
        text-align: center;
        font-weight: bold;
        font-size: 1.2em;
        margin: 0.5em 0 1em 0;
        letter-spacing: 0.2em;
        &::before {
          content: "-";
        }
        &::after {
          content: "-";
        }
      }
      ul {
        list-style: disc;
        list-style-type: inherit;
        li {
          font-size: 0.95em;
          margin: 0.5em 0.5em 0.5em 1.5em;
        }
      }
    }
  }
  .price-section {
    .urikata {
      p {
        color: $color-red;
        text-align: center;
        font-weight: bold;
        font-size: 1.1em;
        margin-top: 1em;
        @media screen and (min-width: 1000px) {
          font-size: 1.4em;
        }
        @media screen and (max-width: 480px) {
          border: 2px solid $color-red;
          width: 90%;
          margin: 1em auto 0 auto;
          text-align: left;
          padding: 1em;
          box-sizing: border-box;
        }
      }
    }
  }
}

.ohsyanton {
  &__text {
    max-width: $max-width;
    width: 95%;
    margin: 0 auto 40px auto;
    columns: 2;
    column-gap: 2em;
    line-height: 1.7em;
    padding: 1em;
    box-sizing: border-box;
    font-size: 1.15em;
    @media screen and (max-width: 780px) {
      columns: 1;
      font-size: 1.05em;
      margin: 0 auto 20px auto;
    }
  }
  .product-list {
    div:last-child {
      visibility: hidden;
    }
  }
}

.price-section {
  .price-title {
    background-color: $color-red;
    color: #fff;
    font-weight: bold;
    font-size: 1.5em;
    text-align: center;
    padding: 0.5em 0 0.3em 0;
    width: 250px;
    margin: 0 auto 20px auto;
    border-radius: 50px;
    line-height: 1em;
    letter-spacing: 0.1em;
    @media screen and (max-width: 480px) {
      font-size: 1.1em;
    }
  }
  .product-list {
    display: flex;
    flex-wrap: wrap;
    justify-content: center;
    max-width: $max-width;
    margin: 0 auto;
    .product {
      width: 45%;
      max-width: 350px;
      min-width: 220px;
      margin: 0.3em;
      font-size: 1.5em;
      color: $color-red;
      border: 3px solid;
      padding: 1em;
      box-sizing: border-box;
      @media screen and (max-width: 780px) {
        font-size: 1.2em;
        padding: 0.7em;
      }
      @media screen and (max-width: 580px) {
        font-size: 3vw;
      }
      @media screen and (max-width: 480px) {
        width: 95%;
        font-size: 3.7vw;
        margin: 0.1em 0;
        padding: 0.4em;
        border: none;
        max-width: 480px;
        display: flex;
        justify-content: space-between;
      }
      dt {
        font-size: 1.2em;
      }
      dd {
        font-weight: bold;
        @media screen and (max-width: 780px) {
          font-size: 1.2em;
        }
        @media screen and (max-width: 480px) {
          text-align: right;
          font-size: 1.3em;
        }
        span {
          font-weight: normal;
          font-size: 0.7em;
        }
      }
    }
  }
  .price-tyui {
    max-width: 1000px;
    margin: 20px auto 0 auto;
    text-align: right;
    ul {
      display: inline-block;
      padding: 1em;
      font-size: 0.9em;
      background-color: #ddd;
      @media screen and (max-width: 480px) {
        display: block;
        font-size: 0.75em;
        margin: 0 auto;
        width: 95%;
      }
      li {
        text-align: left;
      }
    }
  }
}

.btn-home {
  display: block;
  margin: 0 auto;
  width: 210px;
  text-align: center;
  background-color: rgb(110, 99, 92);
  color: #fff;
  padding: 1em 0;
  border-radius: 10px;
}
</style>
